crates/orion-server/tests/benchmark/results/v1.0.0/A_health_baseline.txt

Summary:
  Total:	30.0012 secs
  Slowest:	0.0243 secs
  Fastest:	0.0001 secs
  Average:	0.0015 secs
  Requests/sec:	58801.2943
  
  Total data:	571001692 bytes
  Size/request:	571 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [997777]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [1851]	|
  0.007 [269]	|
  0.010 [62]	|
  0.012 [28]	|
  0.015 [9]	|
  0.017 [1]	|
  0.019 [0]	|
  0.022 [0]	|
  0.024 [2]	|


Latency distribution:
  10%% in 0.0006 secs
  25%% in 0.0007 secs
  50%% in 0.0008 secs
  75%% in 0.0009 secs
  90%% in 0.0011 secs
  95%% in 0.0012 secs
  99%% in 0.0017 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0022 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0031 secs
  resp wait:	0.0015 secs, 0.0001 secs, 0.0242 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0036 secs

Status code distribution:
  [200]	1000000 responses