crates/orion-server/tests/benchmark/results/v1.0.0/B_simple_workflow.txt

Summary:
  Total:	30.6569 secs
  Slowest:	4.5770 secs
  Fastest:	0.0016 secs
  Average:	0.0087 secs
  Requests/sec:	5655.1994
  
  Total data:	14043051 bytes
  Size/request:	81 bytes

Response time histogram:
  0.002 [1]	|
  0.459 [173126]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.917 [167]	|
  1.374 [42]	|
  1.832 [16]	|
  2.289 [7]	|
  2.747 [7]	|
  3.204 [3]	|
  3.662 [0]	|
  4.119 [1]	|
  4.577 [1]	|


Latency distribution:
  10%% in 0.0050 secs
  25%% in 0.0052 secs
  50%% in 0.0071 secs
  75%% in 0.0084 secs
  90%% in 0.0089 secs
  95%% in 0.0093 secs
  99%% in 0.0126 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0015 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0087 secs, 0.0010 secs, 4.5770 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	173371 responses