crates/orion-server/tests/benchmark/results/v1.0.0/D_multi_workflows.txt

Summary:
  Total:	30.1141 secs
  Slowest:	3.2087 secs
  Fastest:	0.0021 secs
  Average:	0.0096 secs
  Requests/sec:	5166.7819
  
  Total data:	17582009 bytes
  Size/request:	113 bytes

Response time histogram:
  0.002 [1]	|
  0.323 [155371]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.643 [91]	|
  0.964 [54]	|
  1.285 [34]	|
  1.605 [17]	|
  1.926 [6]	|
  2.247 [8]	|
  2.567 [5]	|
  2.888 [3]	|
  3.209 [3]	|


Latency distribution:
  10%% in 0.0054 secs
  25%% in 0.0057 secs
  50%% in 0.0085 secs
  75%% in 0.0095 secs
  90%% in 0.0102 secs
  95%% in 0.0109 secs
  99%% in 0.0189 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0017 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0037 secs
  resp wait:	0.0096 secs, 0.0012 secs, 3.2087 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [200]	155593 responses