crates/orion-server/tests/benchmark/results/v1.0.0/E_concurrency_1.txt

Summary:
  Total:	30.0002 secs
  Slowest:	0.0164 secs
  Fastest:	0.0001 secs
  Average:	0.0002 secs
  Requests/sec:	4318.4412
  
  Total data:	10493874 bytes
  Size/request:	81 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [127646]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [314]	|
  0.005 [1494]	|
  0.007 [22]	|
  0.008 [41]	|
  0.010 [28]	|
  0.012 [3]	|
  0.013 [0]	|
  0.015 [3]	|
  0.016 [2]	|


Latency distribution:
  10%% in 0.0001 secs
  25%% in 0.0002 secs
  50%% in 0.0002 secs
  75%% in 0.0002 secs
  90%% in 0.0002 secs
  95%% in 0.0002 secs
  99%% in 0.0036 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0003 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0002 secs, 0.0001 secs, 0.0164 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	129554 responses