crates/orion-server/tests/benchmark/results/v1.0.0/E_concurrency_100.txt

Summary:
  Total:	30.1521 secs
  Slowest:	4.4245 secs
  Fastest:	0.0019 secs
  Average:	0.0202 secs
  Requests/sec:	4932.6613
  
  Total data:	12047130 bytes
  Size/request:	81 bytes

Response time histogram:
  0.002 [1]	|
  0.444 [148527]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.886 [108]	|
  1.329 [43]	|
  1.771 [27]	|
  2.213 [16]	|
  2.655 [4]	|
  3.098 [1]	|
  3.540 [2]	|
  3.982 [0]	|
  4.424 [1]	|


Latency distribution:
  10%% in 0.0156 secs
  25%% in 0.0162 secs
  50%% in 0.0173 secs
  75%% in 0.0199 secs
  90%% in 0.0217 secs
  95%% in 0.0236 secs
  99%% in 0.0304 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0017 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0024 secs
  resp wait:	0.0202 secs, 0.0013 secs, 4.4244 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0008 secs

Status code distribution:
  [200]	148730 responses