crates/orion-server/tests/benchmark/results/v1.0.0/E_concurrency_50.txt

Summary:
  Total:	30.1307 secs
  Slowest:	5.1547 secs
  Fastest:	0.0016 secs
  Average:	0.0099 secs
  Requests/sec:	5034.1981
  
  Total data:	12286404 bytes
  Size/request:	81 bytes

Response time histogram:
  0.002 [1]	|
  0.517 [151479]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  1.032 [133]	|
  1.548 [39]	|
  2.063 [18]	|
  2.578 [4]	|
  3.093 [5]	|
  3.609 [3]	|
  4.124 [1]	|
  4.639 [0]	|
  5.155 [1]	|


Latency distribution:
  10%% in 0.0053 secs
  25%% in 0.0056 secs
  50%% in 0.0087 secs
  75%% in 0.0095 secs
  90%% in 0.0101 secs
  95%% in 0.0109 secs
  99%% in 0.0154 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0013 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0099 secs, 0.0011 secs, 5.1547 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	151684 responses